# PointCloudFilter Properties

---
The PointCloudFilter type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace